day_dict = {
    "01": "Первое",
    "02": "Второе",
    "03": "Третье",
    "04": "Четвертое",
    "05": "Пятое",
    "06": "Шестое",
    "07": "Седьмое",
    "08": "Восьмое",
    "09": "Девятое",
    "10": "Десятое",
    "11": "Одиннадцатое",
    "12": "Двенадцатое",
    "13": "Тринадцатое",
    "14": "Четырнадцатое",
    "15": "Пятнадцатое",
    "16": "Шестнадцатое",
    "17": "Семнадцатое",
    "18": "Восемнадцатое",
    "19": "Девятнадцатое",
    "20": "Двадцатое",
    "21": "Двадцать первое",
    "22": "Двадцать второе",
    "23": "Двадцать третье",
    "24": "Двадцать четсвертое",
    "25": "Двадцать пятое",
    "26": "Двадцать шестое",
    "27": "Двадцать седьмое",
    "28": "Двадцать восьмое",
    "29": "Двадцать девятое",
    "30": "Тридцатое",
    "31": "Тридцать первое"
}

month_dict = {
    "01": "Января",
    "02": "Февраля",
    "03": "Марта",
    "04": "Апреля",
    "05": "Мая",
    "06": "Июня",
    "07": "Июля",
    "08": "Августа",
    "09": "Сентября",
    "10": "Октября",
    "11": "Ноября",
    "12": "Декабря"
}

date = input("Введите дату в дормате дд.мм.гггг: ")
date = date.split(".")
print(date)

print("Прописная дата: {} {} {}".format(day_dict[date[0]], month_dict[date[1]], date[2]))
